; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   white_block_1 yellow_block_1 black_block_1 brown_block_1 grey_block_1 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0) (hold_1) (hold_2) (seen_psi_3) (hold_4) (hold_5) (hold_6))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty) (or (and (ontable yellow_block_1) (not (= ?obj yellow_block_1))) (seen_psi_3)) (not (and (ontable white_block_1) (not (= ?obj white_block_1)))))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (when (and (not (on yellow_block_1 grey_block_1)) (not (or (not (and (clear black_block_1) (not (= ?obj black_block_1)))) (not (and (clear white_block_1) (not (= ?obj white_block_1))))))) (not (hold_1))) (when (or (not (and (clear black_block_1) (not (= ?obj black_block_1)))) (not (and (clear white_block_1) (not (= ?obj white_block_1))))) (hold_1)) (when (not (and (ontable yellow_block_1) (not (= ?obj yellow_block_1)))) (hold_2)) (when (or (not (and (clear brown_block_1) (not (= ?obj brown_block_1)))) (not (and (ontable grey_block_1) (not (= ?obj grey_block_1))))) (seen_psi_3)) (when (not (and (ontable grey_block_1) (not (= ?obj grey_block_1)))) (hold_4)) (when (and (ontable yellow_block_1) (not (= ?obj yellow_block_1))) (hold_5)) (when (and (ontable yellow_block_1) (not (= ?obj yellow_block_1)) (not (or (= ?obj brown_block_1) (holding brown_block_1)))) (not (hold_6))) (when (or (= ?obj brown_block_1) (holding brown_block_1)) (hold_6)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj) (or (= ?obj yellow_block_1) (ontable yellow_block_1) (seen_psi_3)) (not (or (= ?obj white_block_1) (ontable white_block_1))))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (when (and (not (on yellow_block_1 grey_block_1)) (not (or (not (or (= ?obj black_block_1) (clear black_block_1))) (not (or (= ?obj white_block_1) (clear white_block_1)))))) (not (hold_1))) (when (or (not (or (= ?obj black_block_1) (clear black_block_1))) (not (or (= ?obj white_block_1) (clear white_block_1)))) (hold_1)) (when (not (or (= ?obj yellow_block_1) (ontable yellow_block_1))) (hold_2)) (when (or (not (or (= ?obj brown_block_1) (clear brown_block_1))) (not (or (= ?obj grey_block_1) (ontable grey_block_1)))) (seen_psi_3)) (when (not (or (= ?obj grey_block_1) (ontable grey_block_1))) (hold_4)) (when (or (= ?obj yellow_block_1) (ontable yellow_block_1)) (hold_5)) (when (and (or (= ?obj yellow_block_1) (ontable yellow_block_1)) (not (and (holding brown_block_1) (not (= ?obj brown_block_1))))) (not (hold_6))) (when (and (holding brown_block_1) (not (= ?obj brown_block_1))) (hold_6)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (not (or (and (= ?obj yellow_block_1) (= ?underobj grey_block_1)) (on yellow_block_1 grey_block_1))) (hold_0)) (when (and (not (or (and (= ?obj yellow_block_1) (= ?underobj grey_block_1)) (on yellow_block_1 grey_block_1))) (not (or (not (or (= ?obj black_block_1) (and (clear black_block_1) (not (= ?underobj black_block_1))))) (not (or (= ?obj white_block_1) (and (clear white_block_1) (not (= ?underobj white_block_1)))))))) (not (hold_1))) (when (or (not (or (= ?obj black_block_1) (and (clear black_block_1) (not (= ?underobj black_block_1))))) (not (or (= ?obj white_block_1) (and (clear white_block_1) (not (= ?underobj white_block_1)))))) (hold_1)) (when (or (not (or (= ?obj brown_block_1) (and (clear brown_block_1) (not (= ?underobj brown_block_1))))) (not (ontable grey_block_1))) (seen_psi_3)) (when (and (ontable yellow_block_1) (not (and (holding brown_block_1) (not (= ?obj brown_block_1))))) (not (hold_6))) (when (and (holding brown_block_1) (not (= ?obj brown_block_1))) (hold_6)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (not (and (on yellow_block_1 grey_block_1) (not (and (= ?obj yellow_block_1) (= ?underobj grey_block_1))))) (hold_0)) (when (and (not (and (on yellow_block_1 grey_block_1) (not (and (= ?obj yellow_block_1) (= ?underobj grey_block_1))))) (not (or (not (or (= ?underobj black_block_1) (and (clear black_block_1) (not (= ?obj black_block_1))))) (not (or (= ?underobj white_block_1) (and (clear white_block_1) (not (= ?obj white_block_1)))))))) (not (hold_1))) (when (or (not (or (= ?underobj black_block_1) (and (clear black_block_1) (not (= ?obj black_block_1))))) (not (or (= ?underobj white_block_1) (and (clear white_block_1) (not (= ?obj white_block_1)))))) (hold_1)) (when (or (not (or (= ?underobj brown_block_1) (and (clear brown_block_1) (not (= ?obj brown_block_1))))) (not (ontable grey_block_1))) (seen_psi_3)) (when (and (ontable yellow_block_1) (not (or (= ?obj brown_block_1) (holding brown_block_1)))) (not (hold_6))) (when (or (= ?obj brown_block_1) (holding brown_block_1)) (hold_6)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
 )
 (:init (ontable brown_block_1) (ontable yellow_block_1) (on white_block_1 yellow_block_1) (ontable grey_block_1) (on black_block_1 white_block_1) (clear brown_block_1) (clear grey_block_1) (clear black_block_1) (handempty) (hold_0) (hold_1) (hold_5) (= (total-cost) 0))
 (:goal (and (holding yellow_block_1) (hold_0) (hold_1) (hold_2) (hold_4) (hold_5) (hold_6)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack black_block_1 white_block_1)
   deleted: (on black_block_1 white_block_1) (clear black_block_1) (handempty)
   added: (holding black_block_1) (clear white_block_1)
   goals met: 3 of 7
2. (putdown black_block_1)
   deleted: (holding black_block_1) (hold_1)
   added: (clear black_block_1) (handempty) (ontable black_block_1)
   goals met: 2 of 7
3. (unstack white_block_1 yellow_block_1)
   deleted: (on white_block_1 yellow_block_1) (clear white_block_1) (handempty)
   added: (holding white_block_1) (clear yellow_block_1) (hold_1)
   goals met: 3 of 7
4. (stack white_block_1 black_block_1)
   deleted: (clear black_block_1) (holding white_block_1)
   added: (handempty) (clear white_block_1) (on white_block_1 black_block_1)
   goals met: 3 of 7
5. (pickup grey_block_1)
   deleted: (clear grey_block_1) (ontable grey_block_1) (handempty)
   added: (holding grey_block_1) (seen_psi_3) (hold_4)
   goals met: 4 of 7
6. (putdown grey_block_1)
   deleted: (holding grey_block_1)
   added: (clear grey_block_1) (handempty) (ontable grey_block_1)
   goals met: 4 of 7
7. (pickup yellow_block_1)
   deleted: (clear yellow_block_1) (ontable yellow_block_1) (handempty)
   added: (holding yellow_block_1) (hold_2)
   goals met: 6 of 7
8. (stack yellow_block_1 grey_block_1)
   deleted: (clear grey_block_1) (holding yellow_block_1)
   added: (handempty) (clear yellow_block_1) (on yellow_block_1 grey_block_1)
   goals met: 5 of 7
9. (pickup brown_block_1)
   deleted: (clear brown_block_1) (ontable brown_block_1) (handempty)
   added: (holding brown_block_1) (hold_6)
   goals met: 6 of 7
10. (putdown brown_block_1)
   deleted: (holding brown_block_1)
   added: (clear brown_block_1) (handempty) (ontable brown_block_1)
   goals met: 6 of 7
11. (unstack yellow_block_1 grey_block_1)
   deleted: (on yellow_block_1 grey_block_1) (clear yellow_block_1) (handempty)
   added: (holding yellow_block_1) (clear grey_block_1)
   goals met: 7 of 7
